app/serializers/todo_serializer.rb

SELECT "items".* FROM "items" WHERE "items"."todo_id" = ?  [["todo_id", 51]]
---
  def items
    self.object.items.map do |item|